bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/ir_reg.h
/**
  ******************************************************************************
  * @file    ir_reg.h
  * @version V1.0
  * @date    2022-05-30
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __IR_REG_H__
#define __IR_REG_H__

#include "bl702l.h"

/* 0x0 : irtx_config */
#define IRTX_CONFIG_OFFSET                                      (0x0)
#define IR_CR_IRTX_EN                                           IR_CR_IRTX_EN
#define IR_CR_IRTX_EN_POS                                       (0U)
#define IR_CR_IRTX_EN_LEN                                       (1U)
#define IR_CR_IRTX_EN_MSK                                       (((1U<<IR_CR_IRTX_EN_LEN)-1)<<IR_CR_IRTX_EN_POS)
#define IR_CR_IRTX_EN_UMSK                                      (~(((1U<<IR_CR_IRTX_EN_LEN)-1)<<IR_CR_IRTX_EN_POS))
#define IR_CR_IRTX_OUT_INV                                      IR_CR_IRTX_OUT_INV
#define IR_CR_IRTX_OUT_INV_POS                                  (1U)
#define IR_CR_IRTX_OUT_INV_LEN                                  (1U)
#define IR_CR_IRTX_OUT_INV_MSK                                  (((1U<<IR_CR_IRTX_OUT_INV_LEN)-1)<<IR_CR_IRTX_OUT_INV_POS)
#define IR_CR_IRTX_OUT_INV_UMSK                                 (~(((1U<<IR_CR_IRTX_OUT_INV_LEN)-1)<<IR_CR_IRTX_OUT_INV_POS))
#define IR_CR_IRTX_MOD_EN                                       IR_CR_IRTX_MOD_EN
#define IR_CR_IRTX_MOD_EN_POS                                   (2U)
#define IR_CR_IRTX_MOD_EN_LEN                                   (1U)
#define IR_CR_IRTX_MOD_EN_MSK                                   (((1U<<IR_CR_IRTX_MOD_EN_LEN)-1)<<IR_CR_IRTX_MOD_EN_POS)
#define IR_CR_IRTX_MOD_EN_UMSK                                  (~(((1U<<IR_CR_IRTX_MOD_EN_LEN)-1)<<IR_CR_IRTX_MOD_EN_POS))
#define IR_CR_IRTX_SWM_EN                                       IR_CR_IRTX_SWM_EN
#define IR_CR_IRTX_SWM_EN_POS                                   (3U)
#define IR_CR_IRTX_SWM_EN_LEN                                   (1U)
#define IR_CR_IRTX_SWM_EN_MSK                                   (((1U<<IR_CR_IRTX_SWM_EN_LEN)-1)<<IR_CR_IRTX_SWM_EN_POS)
#define IR_CR_IRTX_SWM_EN_UMSK                                  (~(((1U<<IR_CR_IRTX_SWM_EN_LEN)-1)<<IR_CR_IRTX_SWM_EN_POS))
#define IR_CR_IRTX_DATA_EN                                      IR_CR_IRTX_DATA_EN
#define IR_CR_IRTX_DATA_EN_POS                                  (4U)
#define IR_CR_IRTX_DATA_EN_LEN                                  (1U)
#define IR_CR_IRTX_DATA_EN_MSK                                  (((1U<<IR_CR_IRTX_DATA_EN_LEN)-1)<<IR_CR_IRTX_DATA_EN_POS)
#define IR_CR_IRTX_DATA_EN_UMSK                                 (~(((1U<<IR_CR_IRTX_DATA_EN_LEN)-1)<<IR_CR_IRTX_DATA_EN_POS))
#define IR_CR_IRTX_LOGIC0_HL_INV                                IR_CR_IRTX_LOGIC0_HL_INV
#define IR_CR_IRTX_LOGIC0_HL_INV_POS                            (5U)
#define IR_CR_IRTX_LOGIC0_HL_INV_LEN                            (1U)
#define IR_CR_IRTX_LOGIC0_HL_INV_MSK                            (((1U<<IR_CR_IRTX_LOGIC0_HL_INV_LEN)-1)<<IR_CR_IRTX_LOGIC0_HL_INV_POS)
#define IR_CR_IRTX_LOGIC0_HL_INV_UMSK                           (~(((1U<<IR_CR_IRTX_LOGIC0_HL_INV_LEN)-1)<<IR_CR_IRTX_LOGIC0_HL_INV_POS))
#define IR_CR_IRTX_LOGIC1_HL_INV                                IR_CR_IRTX_LOGIC1_HL_INV
#define IR_CR_IRTX_LOGIC1_HL_INV_POS                            (6U)
#define IR_CR_IRTX_LOGIC1_HL_INV_LEN                            (1U)
#define IR_CR_IRTX_LOGIC1_HL_INV_MSK                            (((1U<<IR_CR_IRTX_LOGIC1_HL_INV_LEN)-1)<<IR_CR_IRTX_LOGIC1_HL_INV_POS)
#define IR_CR_IRTX_LOGIC1_HL_INV_UMSK                           (~(((1U<<IR_CR_IRTX_LOGIC1_HL_INV_LEN)-1)<<IR_CR_IRTX_LOGIC1_HL_INV_POS))
#define IR_CR_IRTX_HEAD_EN                                      IR_CR_IRTX_HEAD_EN
#define IR_CR_IRTX_HEAD_EN_POS                                  (8U)
#define IR_CR_IRTX_HEAD_EN_LEN                                  (1U)
#define IR_CR_IRTX_HEAD_EN_MSK                                  (((1U<<IR_CR_IRTX_HEAD_EN_LEN)-1)<<IR_CR_IRTX_HEAD_EN_POS)
#define IR_CR_IRTX_HEAD_EN_UMSK                                 (~(((1U<<IR_CR_IRTX_HEAD_EN_LEN)-1)<<IR_CR_IRTX_HEAD_EN_POS))
#define IR_CR_IRTX_HEAD_HL_INV                                  IR_CR_IRTX_HEAD_HL_INV
#define IR_CR_IRTX_HEAD_HL_INV_POS                              (9U)
#define IR_CR_IRTX_HEAD_HL_INV_LEN                              (1U)
#define IR_CR_IRTX_HEAD_HL_INV_MSK                              (((1U<<IR_CR_IRTX_HEAD_HL_INV_LEN)-1)<<IR_CR_IRTX_HEAD_HL_INV_POS)
#define IR_CR_IRTX_HEAD_HL_INV_UMSK                             (~(((1U<<IR_CR_IRTX_HEAD_HL_INV_LEN)-1)<<IR_CR_IRTX_HEAD_HL_INV_POS))
#define IR_CR_IRTX_TAIL_EN                                      IR_CR_IRTX_TAIL_EN
#define IR_CR_IRTX_TAIL_EN_POS                                  (10U)
#define IR_CR_IRTX_TAIL_EN_LEN                                  (1U)
#define IR_CR_IRTX_TAIL_EN_MSK                                  (((1U<<IR_CR_IRTX_TAIL_EN_LEN)-1)<<IR_CR_IRTX_TAIL_EN_POS)
#define IR_CR_IRTX_TAIL_EN_UMSK                                 (~(((1U<<IR_CR_IRTX_TAIL_EN_LEN)-1)<<IR_CR_IRTX_TAIL_EN_POS))
#define IR_CR_IRTX_TAIL_HL_INV                                  IR_CR_IRTX_TAIL_HL_INV
#define IR_CR_IRTX_TAIL_HL_INV_POS                              (11U)
#define IR_CR_IRTX_TAIL_HL_INV_LEN                              (1U)
#define IR_CR_IRTX_TAIL_HL_INV_MSK                              (((1U<<IR_CR_IRTX_TAIL_HL_INV_LEN)-1)<<IR_CR_IRTX_TAIL_HL_INV_POS)
#define IR_CR_IRTX_TAIL_HL_INV_UMSK                             (~(((1U<<IR_CR_IRTX_TAIL_HL_INV_LEN)-1)<<IR_CR_IRTX_TAIL_HL_INV_POS))
#define IR_CR_IRTX_FRM_EN                                       IR_CR_IRTX_FRM_EN
#define IR_CR_IRTX_FRM_EN_POS                                   (12U)
#define IR_CR_IRTX_FRM_EN_LEN                                   (1U)
#define IR_CR_IRTX_FRM_EN_MSK                                   (((1U<<IR_CR_IRTX_FRM_EN_LEN)-1)<<IR_CR_IRTX_FRM_EN_POS)
#define IR_CR_IRTX_FRM_EN_UMSK                                  (~(((1U<<IR_CR_IRTX_FRM_EN_LEN)-1)<<IR_CR_IRTX_FRM_EN_POS))
#define IR_CR_IRTX_FRM_CONT_EN                                  IR_CR_IRTX_FRM_CONT_EN
#define IR_CR_IRTX_FRM_CONT_EN_POS                              (13U)
#define IR_CR_IRTX_FRM_CONT_EN_LEN                              (1U)
#define IR_CR_IRTX_FRM_CONT_EN_MSK                              (((1U<<IR_CR_IRTX_FRM_CONT_EN_LEN)-1)<<IR_CR_IRTX_FRM_CONT_EN_POS)
#define IR_CR_IRTX_FRM_CONT_EN_UMSK                             (~(((1U<<IR_CR_IRTX_FRM_CONT_EN_LEN)-1)<<IR_CR_IRTX_FRM_CONT_EN_POS))
#define IR_CR_IRTX_FRM_FRAME_SIZE                               IR_CR_IRTX_FRM_FRAME_SIZE
#define IR_CR_IRTX_FRM_FRAME_SIZE_POS                           (14U)
#define IR_CR_IRTX_FRM_FRAME_SIZE_LEN                           (2U)
#define IR_CR_IRTX_FRM_FRAME_SIZE_MSK                           (((1U<<IR_CR_IRTX_FRM_FRAME_SIZE_LEN)-1)<<IR_CR_IRTX_FRM_FRAME_SIZE_POS)
#define IR_CR_IRTX_FRM_FRAME_SIZE_UMSK                          (~(((1U<<IR_CR_IRTX_FRM_FRAME_SIZE_LEN)-1)<<IR_CR_IRTX_FRM_FRAME_SIZE_POS))
#define IR_CR_IRTX_DATA_NUM                                     IR_CR_IRTX_DATA_NUM
#define IR_CR_IRTX_DATA_NUM_POS                                 (16U)
#define IR_CR_IRTX_DATA_NUM_LEN                                 (7U)
#define IR_CR_IRTX_DATA_NUM_MSK                                 (((1U<<IR_CR_IRTX_DATA_NUM_LEN)-1)<<IR_CR_IRTX_DATA_NUM_POS)
#define IR_CR_IRTX_DATA_NUM_UMSK                                (~(((1U<<IR_CR_IRTX_DATA_NUM_LEN)-1)<<IR_CR_IRTX_DATA_NUM_POS))

/* 0x4 : irtx_int_sts */
#define IRTX_INT_STS_OFFSET                                     (0x4)
#define IRTX_END_INT                                            IRTX_END_INT
#define IRTX_END_INT_POS                                        (0U)
#define IRTX_END_INT_LEN                                        (1U)
#define IRTX_END_INT_MSK                                        (((1U<<IRTX_END_INT_LEN)-1)<<IRTX_END_INT_POS)
#define IRTX_END_INT_UMSK                                       (~(((1U<<IRTX_END_INT_LEN)-1)<<IRTX_END_INT_POS))
#define IRTX_FRDY_INT                                           IRTX_FRDY_INT
#define IRTX_FRDY_INT_POS                                       (1U)
#define IRTX_FRDY_INT_LEN                                       (1U)
#define IRTX_FRDY_INT_MSK                                       (((1U<<IRTX_FRDY_INT_LEN)-1)<<IRTX_FRDY_INT_POS)
#define IRTX_FRDY_INT_UMSK                                      (~(((1U<<IRTX_FRDY_INT_LEN)-1)<<IRTX_FRDY_INT_POS))
#define IRTX_FER_INT                                            IRTX_FER_INT
#define IRTX_FER_INT_POS                                        (2U)
#define IRTX_FER_INT_LEN                                        (1U)
#define IRTX_FER_INT_MSK                                        (((1U<<IRTX_FER_INT_LEN)-1)<<IRTX_FER_INT_POS)
#define IRTX_FER_INT_UMSK                                       (~(((1U<<IRTX_FER_INT_LEN)-1)<<IRTX_FER_INT_POS))
#define IR_CR_IRTX_END_MASK                                     IR_CR_IRTX_END_MASK
#define IR_CR_IRTX_END_MASK_POS                                 (8U)
#define IR_CR_IRTX_END_MASK_LEN                                 (1U)
#define IR_CR_IRTX_END_MASK_MSK                                 (((1U<<IR_CR_IRTX_END_MASK_LEN)-1)<<IR_CR_IRTX_END_MASK_POS)
#define IR_CR_IRTX_END_MASK_UMSK                                (~(((1U<<IR_CR_IRTX_END_MASK_LEN)-1)<<IR_CR_IRTX_END_MASK_POS))
#define IR_CR_IRTX_FRDY_MASK                                    IR_CR_IRTX_FRDY_MASK
#define IR_CR_IRTX_FRDY_MASK_POS                                (9U)
#define IR_CR_IRTX_FRDY_MASK_LEN                                (1U)
#define IR_CR_IRTX_FRDY_MASK_MSK                                (((1U<<IR_CR_IRTX_FRDY_MASK_LEN)-1)<<IR_CR_IRTX_FRDY_MASK_POS)
#define IR_CR_IRTX_FRDY_MASK_UMSK                               (~(((1U<<IR_CR_IRTX_FRDY_MASK_LEN)-1)<<IR_CR_IRTX_FRDY_MASK_POS))
#define IR_CR_IRTX_FER_MASK                                     IR_CR_IRTX_FER_MASK
#define IR_CR_IRTX_FER_MASK_POS                                 (10U)
#define IR_CR_IRTX_FER_MASK_LEN                                 (1U)
#define IR_CR_IRTX_FER_MASK_MSK                                 (((1U<<IR_CR_IRTX_FER_MASK_LEN)-1)<<IR_CR_IRTX_FER_MASK_POS)
#define IR_CR_IRTX_FER_MASK_UMSK                                (~(((1U<<IR_CR_IRTX_FER_MASK_LEN)-1)<<IR_CR_IRTX_FER_MASK_POS))
#define IR_CR_IRTX_END_CLR                                      IR_CR_IRTX_END_CLR
#define IR_CR_IRTX_END_CLR_POS                                  (16U)
#define IR_CR_IRTX_END_CLR_LEN                                  (1U)
#define IR_CR_IRTX_END_CLR_MSK                                  (((1U<<IR_CR_IRTX_END_CLR_LEN)-1)<<IR_CR_IRTX_END_CLR_POS)
#define IR_CR_IRTX_END_CLR_UMSK                                 (~(((1U<<IR_CR_IRTX_END_CLR_LEN)-1)<<IR_CR_IRTX_END_CLR_POS))
#define IR_CR_IRTX_END_EN                                       IR_CR_IRTX_END_EN
#define IR_CR_IRTX_END_EN_POS                                   (24U)
#define IR_CR_IRTX_END_EN_LEN                                   (1U)
#define IR_CR_IRTX_END_EN_MSK                                   (((1U<<IR_CR_IRTX_END_EN_LEN)-1)<<IR_CR_IRTX_END_EN_POS)
#define IR_CR_IRTX_END_EN_UMSK                                  (~(((1U<<IR_CR_IRTX_END_EN_LEN)-1)<<IR_CR_IRTX_END_EN_POS))
#define IR_CR_IRTX_FRDY_EN                                      IR_CR_IRTX_FRDY_EN
#define IR_CR_IRTX_FRDY_EN_POS                                  (25U)
#define IR_CR_IRTX_FRDY_EN_LEN                                  (1U)
#define IR_CR_IRTX_FRDY_EN_MSK                                  (((1U<<IR_CR_IRTX_FRDY_EN_LEN)-1)<<IR_CR_IRTX_FRDY_EN_POS)
#define IR_CR_IRTX_FRDY_EN_UMSK                                 (~(((1U<<IR_CR_IRTX_FRDY_EN_LEN)-1)<<IR_CR_IRTX_FRDY_EN_POS))
#define IR_CR_IRTX_FER_EN                                       IR_CR_IRTX_FER_EN
#define IR_CR_IRTX_FER_EN_POS                                   (26U)
#define IR_CR_IRTX_FER_EN_LEN                                   (1U)
#define IR_CR_IRTX_FER_EN_MSK                                   (((1U<<IR_CR_IRTX_FER_EN_LEN)-1)<<IR_CR_IRTX_FER_EN_POS)
#define IR_CR_IRTX_FER_EN_UMSK                                  (~(((1U<<IR_CR_IRTX_FER_EN_LEN)-1)<<IR_CR_IRTX_FER_EN_POS))

