bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/ir_reg.h
    /* 0x8  reserved */
    uint8_t RESERVED0x8[8];

    /* 0x10 : irtx_pulse_width */
    union {
        struct {
            uint32_t cr_irtx_pw_unit                : 12; /* [11: 0],        r/w,      0x464 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t cr_irtx_mod_ph0_w              :  8; /* [23:16],        r/w,       0x11 */
            uint32_t cr_irtx_mod_ph1_w              :  8; /* [31:24],        r/w,       0x22 */
        }BF;
        uint32_t WORD;
    } irtx_pulse_width;

    /* 0x14 : irtx_pw_0 */
    union {
        struct {
            uint32_t cr_irtx_logic0_ph0_w           :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t cr_irtx_logic0_ph1_w           :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t cr_irtx_logic1_ph0_w           :  8; /* [23:16],        r/w,        0x0 */
            uint32_t cr_irtx_logic1_ph1_w           :  8; /* [31:24],        r/w,        0x2 */
        }BF;
        uint32_t WORD;
    } irtx_pw_0;

    /* 0x18 : irtx_pw_1 */
    union {
        struct {
            uint32_t cr_irtx_head_ph0_w             :  8; /* [ 7: 0],        r/w,        0xf */
            uint32_t cr_irtx_head_ph1_w             :  8; /* [15: 8],        r/w,        0x7 */
            uint32_t cr_irtx_tail_ph0_w             :  8; /* [23:16],        r/w,        0x0 */
            uint32_t cr_irtx_tail_ph1_w             :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } irtx_pw_1;

    /* 0x1c  reserved */
    uint8_t RESERVED0x1c[100];

    /* 0x80 : ir_fifo_config_0 */
    union {
        struct {
            uint32_t irtx_dma_en                    :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1                     :  1; /* [    1],       rsvd,        0x0 */
            uint32_t tx_fifo_clr                    :  1; /* [    2],        w1c,        0x0 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t tx_fifo_overflow               :  1; /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow              :  1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_31                  : 26; /* [31: 6],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ir_fifo_config_0;

    /* 0x84 : ir_fifo_config_1 */
    union {
        struct {
            uint32_t tx_fifo_cnt                    :  3; /* [ 2: 0],          r,        0x4 */
            uint32_t reserved_3_15                  : 13; /* [15: 3],       rsvd,        0x0 */
            uint32_t tx_fifo_th                     :  2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31                 : 14; /* [31:18],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ir_fifo_config_1;

    /* 0x88 : ir_fifo_wdata */
    union {
        struct {
            uint32_t tx_fifo_wdata                  : 32; /* [31: 0],          w,        0x0 */
        }BF;
        uint32_t WORD;
    } ir_fifo_wdata;

};

typedef volatile struct ir_reg ir_reg_t;


#endif  /* __IR_REG_H__ */
